# სლაისინგი (slicing) გამოიყენება რამდენიმე ელემენტის (ნაწილის) მისაღებად
# მაგალითად word[0:2] გამოიტანს 0- დან 2 ინდექსამდე ელემენტებს
#სლაისინგში შეგვიძლია ნაბიჯის მითითებაც

surname = "beridze"

print("ბოლო 5 ასო", surname[-5])

numbers = [1,2,4,5,6,7,8,9,10]

print("პირველი სამი", numbers[:3])

print("ბოლო ოთხი", numbers[-4])

print("შუაში ორი:", numbers[4:6])

user_surname = input("შეიყვანე შენი გვარი: ")

print("შებრუნებული გვარი:", user_surname[::-1])

movie = "inception"

print("ყოველი მეორე ასო", movie[::2])
